### Tasks::
- Combined Average Income of all states from 2005 to 2013
- State with highest average income in the last three years
- State with lowest average income from 2007 to 2010(inclusive)
- Print the list of all states in the same line with average income less than California
- Print the names of states based on descending order of income in the year 2009
- State with the lowest recorded income from 2005 to 2013

In [1]:
#function to read csv data into data frame
#returns the dataframe object
import pandas as pd
df =pd.read_csv("Datafiles/income.csv")
df

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,62993,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528

In [2]:
df.index=df['State']
df

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
State,,,,,,,,,,,
Alabama,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
Alaska,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
Arizona,04000US04,Arizona,45245,46657,62993,46914,45739,46896,48621,47044,50602
Arkansas,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
California,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528

In [3]:
df.iloc[:,2:]

             2005   2006   2007   2008   2009   2010   2011   2012   2013
State
Alabama     37150  37952  42212  44476  39980  40933  42590  43464  41381
Alaska      55891  56418  62993  63989  61604  57848  57431  63648  61137
Arizona     45245  46657  62993  46914  45739  46896  48621  47044  50602
Arkansas    36658  37057  40795  39586  36538  38587  41302  39018  39919
California  51755  55319  55734  57014  56134  54283  53367  57020  57528

In [4]:
cal=df.iloc[4,2:].mean()# iloc means idlocation ,mean means average
cal

55350.444444444445

### average states

In [5]:
df.iloc[:,2:].mean(axis=1)#inwhich axis=1 means this gives the rows average it means statewise average(all states individual average)

State
Alabama       41126.444444
Alaska        60106.555556
Arizona       48967.888889
Arkansas      38828.888889
California    55350.444444
dtype: float64

### For last 3 years

In [6]:
df.iloc[:,-3:]#for last 3 years

             2011   2012   2013
State
Alabama     42590  43464  41381
Alaska      57431  63648  61137
Arizona     48621  47044  50602
Arkansas    41302  39018  39919
California  53367  57020  57528

In [7]:
df.iloc[:,-3:].mean(axis=1)#last 3years average

State
Alabama       42478.333333
Alaska        60738.666667
Arizona       48755.666667
Arkansas      40079.666667
California    55971.666667
dtype: float64

In [8]:
df.iloc[:,-3:].mean(axis=1).idxmax()#max highest average income in the last 3years

'Alaska'

In [9]:
df.iloc[:,-3:].mean(axis=1).idxmin()#min highest average income in the last 3years

'Arkansas'

In [10]:
df.iloc[:,4:8]

             2007   2008   2009   2010
State
Alabama     42212  44476  39980  40933
Alaska      62993  63989  61604  57848
Arizona     62993  46914  45739  46896
Arkansas    40795  39586  36538  38587
California  55734  57014  56134  54283

In [11]:
df.iloc[:,4:8].mean()

2007    52945.4
2008    50395.8
2009    47999.0
2010    47709.4
dtype: float64

In [12]:
df.iloc[:,4:8].mean(axis=1)

State
Alabama       41900.25
Alaska        61608.50
Arizona       50635.50
Arkansas      38876.50
California    55791.25
dtype: float64

In [13]:
df.iloc[:,4:8].mean(axis=1).idxmin()

'Arkansas'

### Print the list of all states in the same line with average income less than California

In [14]:
df.iloc[4:,2:]

             2005   2006   2007   2008   2009   2010   2011   2012   2013
State
California  51755  55319  55734  57014  56134  54283  53367  57020  57528

In [15]:
df.iloc[4:,2:].mean(axis=1)

State
California    55350.444444
dtype: float64

In [16]:
list(df[df.iloc[:,2:].mean(axis=1)<cal].index)

['Alabama', 'Arizona', 'Arkansas']

In [17]:
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                         cal

55350.444444444445

### Print the names of states based on descending order of income in the year 2009

In [34]:
df.iloc[:,6:-4]

             2009
State
Alabama     39980
Alaska      61604
Arizona     45739
Arkansas    36538
California  56134

In [41]:
df.iloc[:,6:-4].mean(axis=1)

State
Alabama       39980.0
Alaska        61604.0
Arizona       45739.0
Arkansas      36538.0
California    56134.0
dtype: float64

In [26]:
list(df.iloc[:,6].sort_values(ascending =False).index)

['Alaska', 'California', 'Arizona', 'Alabama', 'Arkansas']

### State with the lowest recorded income from 2005 to 2013

In [42]:
df.iloc[:,2:]

             2005   2006   2007   2008   2009   2010   2011   2012   2013
State
Alabama     37150  37952  42212  44476  39980  40933  42590  43464  41381
Alaska      55891  56418  62993  63989  61604  57848  57431  63648  61137
Arizona     45245  46657  62993  46914  45739  46896  48621  47044  50602
Arkansas    36658  37057  40795  39586  36538  38587  41302  39018  39919
California  51755  55319  55734  57014  56134  54283  53367  57020  57528

In [44]:
df.iloc[:,2:].idxmin()

SyntaxError: invalid syntax (<ipython-input-44-0e94c9a6dfd4>, line 1)